function populate(s1,s2){
    var s1 = document.getElementById(s1);
    var s2 = document.getElementById(s2);

    s2.innerHTML = "";

    if(s1.value == "هەولێر"){
        var optionArray = ['ناوەند|ناوەند', 'چۆمان|چۆمان', 'خەبات|خەبات', 'ڕەواندز|ڕەواندز', 'دەشتی هەولێر|دەشتی هەولێر', 'سۆران|سۆران', 'شەقڵاوە|شەقڵاوە', 'کۆیە|کۆیە', 'ماخمور|ماخمور', 'مێرگەسۆر|مێرگەسۆر', 'بەردەڕەش|بەردەڕەش', 'بالیسان|بالیسان', 'مەسیف|مەسیف'];
    }
    else if(s1.value == 'سلێمانی'){
        var optionArray = ['ناوەند|ناوەند', 'شارباژێڕ|شارباژێڕ', 'شارەزوور|شارەزوور', 'چەمچەماڵ|چەمچەماڵ', 'ماوەت|ماوەت', 'قەڵادزێ|قەڵادزێ', 'ڕانیە|ڕانیە', 'دوکان|دوکان', 'بازیان|بازیان', 'کەلار|کەلار', 'کفری|کفری', 'دەربەندیخان|دەربەندیخان', 'عەربەت|عەربەت', 'پیرەمەگروون|پیرەمەگروون', 'سەیدسادق|سەیدسادق', 'پێنجوێن|پێنجوێن', 'چوارتا|چوارتا', 'خەلەکان|خەلەکان'];
    }
    else if(s1.value == 'دهۆک'){
        var optionArray = ['ناوەند|ناوەند', 'زاخۆ|زاخۆ', 'سیمێڵ|سیمێڵ', 'ئاکرێ|ئاکرێ', 'شێخان|شێخان'];
    }
    else if(s1.value == 'کەرکوک'){
        var optionArray = ['ناوەند|ناوەند', 'داقوق|داقوق', 'حەویجە|حەویجە', 'دوبز|دوبز'];
    }
    else if(s1.value == 'هەڵەبجە'){
        var optionArray = ['ناوەند|ناوەند','سیروان|سیروان', 'بیارە|بیارە', 'خورماڵ|خورماڵ'];
    }

    for(var option in optionArray){
        var pair = optionArray[option].split("|");
        var newoption = document.createElement("option");

        newoption.value = pair[0];
        newoption.innerHTML = pair[1];
        s2.options.add(newoption);
    }
}
